# Titanic

In [1]:
import pickle
import numpy as np
import pandas as pd

In [2]:
# !pip install --upgrade scikit-learn

In [3]:
dataset = pd.read_csv('train.csv', encoding='latin-1')
datasetTest = pd.read_csv('test.csv', encoding='latin-1')
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
dataset.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
dataset = dataset[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked', 'Survived']]
dataset['Sex'] = dataset['Sex'].astype('object').map({'male': 0, 'female': 1})
dataset['Age'] = pd.to_numeric(dataset['Age'], errors='coerce')
dataset['Age'] = dataset['Age'].fillna(np.mean(dataset['Age']))
dataset.head()

   Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Survived
0       3    0  22.0      1      0   7.2500        S         0
1       1    1  38.0      1      0  71.2833        C         1
2       3    1  26.0      0      0   7.9250        S         1
3       1    1  35.0      1      0  53.1000        S         1
4       3    0  35.0      0      0   8.0500        S         0

In [7]:
# from sklearn.preprocessing import LabelEncoder
# le = LabelEncoder()
# dataset['Sex'] = le.fit_transform(dataset['Sex'])
# dataset.head()

In [8]:
embarked_dummies = pd.get_dummies(dataset['Embarked'])
dataset = pd.concat([dataset, embarked_dummies], axis=1)
dataset = dataset.drop(['Embarked'], axis=1)
dataset.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Survived  C  Q  S
0       3    0  22.0      1      0   7.2500         0  0  0  1
1       1    1  38.0      1      0  71.2833         1  1  0  0
2       3    1  26.0      0      0   7.9250         1  0  0  1
3       1    1  35.0      1      0  53.1000         1  0  0  1
4       3    0  35.0      0      0   8.0500         0  0  0  1

In [9]:
X = dataset.drop(['Survived'], axis=1)
y = dataset['Survived']

In [10]:
print(X)

     Pclass  Sex        Age  SibSp  Parch     Fare  C  Q  S
0         3    0  22.000000      1      0   7.2500  0  0  1
1         1    1  38.000000      1      0  71.2833  1  0  0
2         3    1  26.000000      0      0   7.9250  0  0  1
3         1    1  35.000000      1      0  53.1000  0  0  1
4         3    0  35.000000      0      0   8.0500  0  0  1
..      ...  ...        ...    ...    ...      ... .. .. ..
886       2    0  27.000000      0      0  13.0000  0  0  1
887       1    1  19.000000      0      0  30.0000  0  0  1
888       3    1  29.699118      1      2  23.4500  0  0  1
889       1    0  26.000000      0      0  30.0000  1  0  0
890       3    0  32.000000      0      0   7.7500  0  1  0

[891 rows x 9 columns]

In [11]:
print(y)

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [13]:
print(X_train)

     Pclass  Sex        Age  SibSp  Parch     Fare  C  Q  S
140       3    1  29.699118      0      2  15.2458  1  0  0
439       2    0  31.000000      0      0  10.5000  0  0  1
817       2    0  31.000000      1      1  37.0042  1  0  0
378       3    0  20.000000      0      0   4.0125  1  0  0
491       3    0  21.000000      0      0   7.2500  0  0  1
..      ...  ...        ...    ...    ...      ... .. .. ..
835       1    1  39.000000      1      1  83.1583  1  0  0
192       3    1  19.000000      1      0   7.8542  0  0  1
629       3    0  29.699118      0      0   7.7333  0  1  0
559       3    1  36.000000      1      0  17.4000  0  0  1
684       2    0  60.000000      1      1  39.0000  0  0  1

[712 rows x 9 columns]

In [14]:
print(X_test)

     Pclass  Sex        Age  SibSp  Parch      Fare  C  Q  S
495       3    0  29.699118      0      0   14.4583  1  0  0
648       3    0  29.699118      0      0    7.5500  0  0  1
278       3    0   7.000000      4      1   29.1250  0  1  0
31        1    1  29.699118      1      0  146.5208  1  0  0
255       3    1  29.000000      0      2   15.2458  1  0  0
..      ...  ...        ...    ...    ...       ... .. .. ..
780       3    1  13.000000      0      0    7.2292  1  0  0
837       3    0  29.699118      0      0    8.0500  0  0  1
215       1    1  31.000000      1      0  113.2750  1  0  0
833       3    0  23.000000      0      0    7.8542  0  0  1
372       3    0  19.000000      0      0    8.0500  0  0  1

[179 rows x 9 columns]

In [15]:
print(y_train)

140    0
439    0
817    0
378    0
491    0
      ..
835    1
192    1
629    0
559    1
684    0
Name: Survived, Length: 712, dtype: int64

In [16]:
print(y_test)

495    0
648    0
278    0
31     1
255    1
      ..
780    1
837    0
215    1
833    0
372    0
Name: Survived, Length: 179, dtype: int64

In [17]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [18]:
print(X_train)

[[ 8.19250590e-01  1.37207547e+00 -2.82437263e-03 ...  2.12588331e+00
  -3.14269681e-01 -1.62827579e+00]
 [-3.80968381e-01 -7.28822884e-01  9.66293694e-02 ... -4.70392705e-01
  -3.14269681e-01  6.14146575e-01]
 [-3.80968381e-01 -7.28822884e-01  9.66293694e-02 ...  2.12588331e+00
  -3.14269681e-01 -1.62827579e+00]
 ...
 [ 8.19250590e-01 -7.28822884e-01 -2.82437263e-03 ... -4.70392705e-01
   3.18198052e+00 -1.62827579e+00]
 [ 8.19250590e-01  1.37207547e+00  4.78884313e-01 ... -4.70392705e-01
  -3.14269681e-01  6.14146575e-01]
 [-3.80968381e-01 -7.28822884e-01  2.31370804e+00 ... -4.70392705e-01
  -3.14269681e-01  6.14146575e-01]]

In [19]:
print(X_test)

[[ 8.19250590e-01 -7.28822884e-01 -2.82437263e-03 ...  2.12588331e+00
  -3.14269681e-01 -1.62827579e+00]
 [ 8.19250590e-01 -7.28822884e-01 -2.82437263e-03 ... -4.70392705e-01
  -3.14269681e-01  6.14146575e-01]
 [ 8.19250590e-01 -7.28822884e-01 -1.73819436e+00 ... -4.70392705e-01
   3.18198052e+00 -1.62827579e+00]
 ...
 [-1.58118735e+00  1.37207547e+00  9.66293694e-02 ...  2.12588331e+00
  -3.14269681e-01 -1.62827579e+00]
 [ 8.19250590e-01 -7.28822884e-01 -5.14978540e-01 ... -4.70392705e-01
  -3.14269681e-01  6.14146575e-01]
 [ 8.19250590e-01 -7.28822884e-01 -8.20782494e-01 ... -4.70392705e-01
  -3.14269681e-01  6.14146575e-01]]

In [20]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression(random_state = 0)
classifier.fit(X_train, y_train)

LogisticRegression(random_state=0)

In [21]:
# Not Survived
print(classifier.predict(sc.transform([[3, 0, 22, 1, 0, 7.25, 0, 0, 1]])))

[0]

C:\Users\DELL\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but StandardScaler was fitted with feature names
  warnings.warn(

In [22]:
# Not Survived
print(classifier.predict(sc.transform([[1, 1, 38, 1, 0, 71.2833, 1, 0, 0]])))

[1]

C:\Users\DELL\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but StandardScaler was fitted with feature names
  warnings.warn(

In [23]:
y_pred = classifier.predict(X_test)
print(y_pred)

[0 0 0 1 1 0 1 1 1 1 0 1 0 1 1 1 0 0 0 0 0 1 0 0 1 1 0 1 1 1 0 1 0 0 0 1 0
 0 0 0 0 0 0 0 1 0 0 1 0 0 0 1 1 0 1 0 0 0 0 0 0 1 1 1 1 0 1 0 1 1 1 0 1 0
 0 1 0 0 0 0 0 0 1 0 0 1 1 0 1 1 0 0 0 1 1 0 1 0 0 1 0 0 0 0 1 0 1 0 0 1 0
 1 0 1 0 1 1 1 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 0 0 0 1 0 1 1 1 0 1
 1 0 0 1 1 0 1 0 1 0 1 1 0 0 1 0 0 0 0 0 0 0 0 1 0 0 1 0 1 0 0]

In [24]:
# print(np.concatenate((y_pred.reshape(len(y_pred),1),
#                       y_test.reshape(len(y_test),1)),1))

In [25]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test, y_pred)
print(cm)

[[92 18]
 [18 51]]

In [26]:
from sklearn.model_selection import cross_val_score
accuracies = cross_val_score(estimator = classifier, X = X_train, y = y_train, cv = 10)
print("Accuracy: {:.2f} %".format(accuracies.mean()*100))
print("Standard Deviation: {:.2f} %".format(accuracies.std()*100))

Accuracy: 78.52 %
Standard Deviation: 3.93 %